package CodeWars.Number.ОкругленняЧисел;

public class Run {
    public static void main(String[] args) {
        System.out.println(roundToNext5(21));
    }

    public static int roundToNext5(int number) {
        while((number % 5) != 0){
            number++;
        }
        return number;
    }
}

//    Враховуючи ціле число як вхідне число, чи можете ви округлити його до наступного
//    (тобто «вищого») кратного 5?
//
//    Приклади:
//
//    введення-виведення:
//    0 -> 0
//    2 -> 5
//    3 -> 5
//    12 -> 15
//    21 -> 25
//    30 -> 30
//    -2 -> 0
//    -5 -> -5
//    тощо
//    Вхідним може бути будь-яке додатне або від’ємне ціле число (включаючи 0).
//
//    Можна припустити, що всі введені дані є дійсними цілими числами.
